#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/849b449c-d7d6-42cc-b879-44fabd05b664/terraform-bin plan -out=tfplan -no-color
module.s3_alb_logs.data.aws_caller_identity.current: Reading...
module.ecr_pipeline.data.aws_caller_identity.current: Reading...
aws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a5f092444dfe09e4]
aws_cloudwatch_log_group.ecs_datapipeline: Refreshing state... [id=/ecs/aidoctors-datapipeline]
module.ecr_app.data.aws_caller_identity.current: Reading...
module.s3_alb_logs.data.aws_partition.current: Reading...
module.ecr_pipeline.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_alb_logs.data.aws_region.current: Reading...
module.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecr_app.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]
module.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]
module.ecr_app.data.aws_partition.current: Reading...
module.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_pipeline.data.aws_partition.current: Reading...
module.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]
aws_cloudwatch_log_group.ecs_app: Refreshing state... [id=/ecs/aidoctors-app]
module.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z06427697G70NONHREY0]
module.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]
module.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]
module.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]
module.ecr_app.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr_pipeline.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.ecr_app.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr_pipeline.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:cluster/aidoctors-cluster]
aws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]
aws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]
aws_ecs_task_definition.pipeline: Refreshing state... [id=aidoctors-pipeline]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-04011982dab9c4282]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d5af4b0c04827821]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0de00d15bc8f05622]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0e10642673fd7c188]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-03d9ec42eb58faad0]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e159e8cdad3d2eda]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00885382907f931fa]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-008e370a40ce2129a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08c80c1a556c68a64]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-030b61924711d50d7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09806edc6a428e591]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bde8fedbd070c8c6]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0ea489e5a5d991510]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-066e63b2e520f56c4]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0921ac3c511e011e1]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09cd90b55f90afe64]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00885382907f931fa1080289494]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1243875112]
module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2126675536]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0769742f3914f98ae]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c232b5f5777792af]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0073da9719a259105]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0132d06df78f7a83e]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0028d31ae36439fb2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-059ba97b96766960b]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d02c6c0cf97b5967]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a9b7a604d88368b1]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-03d9ec42eb58faad01080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-008e370a40ce2129a1080289494]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0b3761c24808db9df]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-2025103116123436880000000a]
module.alb.data.aws_partition.current[0]: Reading...
module.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251031161234367500000008/3cd34afdf4c9772b]
module.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-0851581ced86e8e5e]
module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-01d60903fa19d6f70]
module.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0563848c04dad4cf9]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-04ede089e9eb02d3d]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
aws_ecs_service.pipeline: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-pipeline-service]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-DFWMHI3HJREGML553INSPDGI7Q]
module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:033236469452:secret:rds!db-2755fad1-0397-4e23-b162-13aa02fb10e7-hQCdE9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.db.module.db_instance.aws_db_instance.this[0] has changed
  ~ resource "aws_db_instance" "this" {
      + domain_dns_ips                        = []
        id                                    = "db-DFWMHI3HJREGML553INSPDGI7Q"
        tags                                  = {
            "Name" = "aidoctors-postgres"
        }
        # (73 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecs_service.app will be created
  + resource "aws_ecs_service" "app" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = "arn:aws:ecs:us-east-1:033236469452:cluster/aidoctors-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "aidoctors-app-service"
      + platform_version                   = (known after apply)
      + region                             = "us-east-1"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "aidoctors-app-service"
        }
      + tags_all                           = {
          + "Name" = "aidoctors-app-service"
        }
      + task_definition                    = "arn:aws:ecs:us-east-1:033236469452:task-definition/aidoctors-app:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + load_balancer {
          + container_name   = "aidoctors-app-container"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251031161234367500000008/3cd34afdf4c9772b"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-04ede089e9eb02d3d",
            ]
          + subnets          = [
              + "subnet-030b61924711d50d7",
              + "subnet-08c80c1a556c68a64",
            ]
        }
    }

  # aws_route53_record.root will be created
  + resource "aws_route53_record" "root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "aidoctors.com"
      + type            = "A"
      + zone_id         = "Z06427697G70NONHREY0"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "aidoctors-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = [
          + "sg-0b3761c24808db9df",
        ]
      + subnets                                                      = [
          + "subnet-09806edc6a428e591",
          + "subnet-0bde8fedbd070c8c6",
        ]
      + tags                                                         = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
        }

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.this["ex-http"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251031161234367500000008/3cd34afdf4c9772b"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.s3_alb_logs.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "elb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ELBRegionUs-East-1"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::127311923021:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
            # (1 unchanged attribute hidden)

          + principals {
              + identifiers = [
                  + "logdelivery.elasticloadbalancing.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AlbNlbLogDeliveryWrite"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AlbNlbLogDeliveryAclCheck"

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3_alb_logs.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "aidoctors-alb-logfiles"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"    = "aidoctors-alb-logs"
          + "Purpose" = "ALB Access Logs"
        }
      + tags_all                    = {
          + "Name"    = "aidoctors-alb-logs"
          + "Purpose" = "ALB Access Logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "log-retention"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }
    }

  # module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.s3_alb_logs.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-1"
      + restrict_public_buckets = true
      + skip_destroy            = true
    }

  # module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3_alb_logs.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.s3_alb_logs.data.aws_caller_identity.current: Reading...%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Reading...%0Aaws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a5f092444dfe09e4]%0Aaws_cloudwatch_log_group.ecs_datapipeline: Refreshing state... [id=/ecs/aidoctors-datapipeline]%0Amodule.ecr_app.data.aws_caller_identity.current: Reading...%0Amodule.s3_alb_logs.data.aws_partition.current: Reading...%0Amodule.ecr_pipeline.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.s3_alb_logs.data.aws_region.current: Reading...%0Amodule.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.ecr_app.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]%0Amodule.ecr_app.data.aws_partition.current: Reading...%0Amodule.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecr_pipeline.data.aws_partition.current: Reading...%0Amodule.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]%0Aaws_cloudwatch_log_group.ecs_app: Refreshing state... [id=/ecs/aidoctors-app]%0Amodule.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z06427697G70NONHREY0]%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]%0Amodule.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]%0Amodule.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]%0Amodule.ecr_app.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr_pipeline.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecr_app.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr_pipeline.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:cluster/aidoctors-cluster]%0Aaws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]%0Aaws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Aaws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]%0Aaws_ecs_task_definition.pipeline: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-04011982dab9c4282]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d5af4b0c04827821]%0Amodule.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0de00d15bc8f05622]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0e10642673fd7c188]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-03d9ec42eb58faad0]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e159e8cdad3d2eda]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00885382907f931fa]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-008e370a40ce2129a]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08c80c1a556c68a64]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-030b61924711d50d7]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09806edc6a428e591]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bde8fedbd070c8c6]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0ea489e5a5d991510]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-066e63b2e520f56c4]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0921ac3c511e011e1]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09cd90b55f90afe64]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00885382907f931fa1080289494]%0Amodule.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1243875112]%0Amodule.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2126675536]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0769742f3914f98ae]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c232b5f5777792af]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0073da9719a259105]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0132d06df78f7a83e]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0028d31ae36439fb2]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-059ba97b96766960b]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d02c6c0cf97b5967]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a9b7a604d88368b1]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-03d9ec42eb58faad01080289494]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-008e370a40ce2129a1080289494]%0Amodule.db.module.db_instance.data.aws_partition.current: Reading...%0Amodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]%0Amodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]%0Amodule.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0b3761c24808db9df]%0Amodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-2025103116123436880000000a]%0Amodule.alb.data.aws_partition.current[0]: Reading...%0Amodule.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]%0Amodule.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251031161234367500000008/3cd34afdf4c9772b]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-0851581ced86e8e5e]%0Amodule.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-01d60903fa19d6f70]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0563848c04dad4cf9]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-04ede089e9eb02d3d]%0Amodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]%0Aaws_ecs_service.pipeline: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-pipeline-service]%0Amodule.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-DFWMHI3HJREGML553INSPDGI7Q]%0Amodule.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:033236469452:secret:rds!db-2755fad1-0397-4e23-b162-13aa02fb10e7-hQCdE9]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.db.module.db_instance.aws_db_instance.this[0] has changed%0A  ~ resource "aws_db_instance" "this" {%0A      + domain_dns_ips                        = []%0A        id                                    = "db-DFWMHI3HJREGML553INSPDGI7Q"%0A        tags                                  = {%0A            "Name" = "aidoctors-postgres"%0A        }%0A        # (73 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecs_service.app will be created%0A  + resource "aws_ecs_service" "app" {%0A      + arn                                = (known after apply)%0A      + availability_zone_rebalancing      = (known after apply)%0A      + cluster                            = "arn:aws:ecs:us-east-1:033236469452:cluster/aidoctors-cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "aidoctors-app-service"%0A      + platform_version                   = (known after apply)%0A      + region                             = "us-east-1"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Name" = "aidoctors-app-service"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aidoctors-app-service"%0A        }%0A      + task_definition                    = "arn:aws:ecs:us-east-1:033236469452:task-definition/aidoctors-app:1"%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + deployment_configuration (known after apply)%0A%0A      + load_balancer {%0A          + container_name   = "aidoctors-app-container"%0A          + container_port   = 80%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251031161234367500000008/3cd34afdf4c9772b"%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-04ede089e9eb02d3d",%0A            ]%0A          + subnets          = [%0A              + "subnet-030b61924711d50d7",%0A              + "subnet-08c80c1a556c68a64",%0A            ]%0A        }%0A    }%0A%0A  # aws_route53_record.root will be created%0A  + resource "aws_route53_record" "root" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "aidoctors.com"%0A      + type            = "A"%0A      + zone_id         = "Z06427697G70NONHREY0"%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # module.alb.aws_lb.this[0] will be created%0A  + resource "aws_lb" "this" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = true%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "aidoctors-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + region                                                       = "us-east-1"%0A      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)%0A      + security_groups                                              = [%0A          + "sg-0b3761c24808db9df",%0A        ]%0A      + subnets                                                      = [%0A          + "subnet-09806edc6a428e591",%0A          + "subnet-0bde8fedbd070c8c6",%0A        ]%0A      + tags                                                         = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                                                     = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + access_logs {%0A          + bucket  = (known after apply)%0A          + enabled = true%0A        }%0A%0A      + subnet_mapping (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_listener.this["ex-http"] will be created%0A  + resource "aws_lb_listener" "this" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + region                                                                = "us-east-1"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags                                                                  = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                                                              = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251031161234367500000008/3cd34afdf4c9772b"%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0A  # module.s3_alb_logs.data.aws_iam_policy_document.combined[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "combined" {%0A      + id                      = (known after apply)%0A      + json                    = (known after apply)%0A      + minified_json           = (known after apply)%0A      + source_policy_documents = (known after apply)%0A    }%0A%0A  # module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "elb_log_delivery" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:PutObject",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "ELBRegionUs-East-1"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "arn:aws:iam::127311923021:root",%0A                ]%0A              + type        = "AWS"%0A            }%0A        }%0A      + statement {%0A          + actions   = [%0A              + "s3:PutObject",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A            # (1 unchanged attribute hidden)%0A%0A          + principals {%0A              + identifiers = [%0A                  + "logdelivery.elasticloadbalancing.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "lb_log_delivery" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:PutObject",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AlbNlbLogDeliveryWrite"%0A%0A          + condition {%0A              + test     = "StringEquals"%0A              + values   = [%0A                  + "bucket-owner-full-control",%0A                ]%0A              + variable = "s3:x-amz-acl"%0A            }%0A%0A          + principals {%0A              + identifiers = [%0A                  + "delivery.logs.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A      + statement {%0A          + actions   = [%0A              + "s3:GetBucketAcl",%0A              + "s3:ListBucket",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AlbNlbLogDeliveryAclCheck"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "delivery.logs.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket.this[0] will be created%0A  + resource "aws_s3_bucket" "this" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "aidoctors-alb-logfiles"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = false%0A      + policy                      = (known after apply)%0A      + region                      = "us-east-1"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Name"    = "aidoctors-alb-logs"%0A          + "Purpose" = "ALB Access Logs"%0A        }%0A      + tags_all                    = {%0A          + "Name"    = "aidoctors-alb-logs"%0A          + "Purpose" = "ALB Access Logs"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0] will be created%0A  + resource "aws_s3_bucket_lifecycle_configuration" "this" {%0A      + bucket                                 = (known after apply)%0A      + expected_bucket_owner                  = (known after apply)%0A      + id                                     = (known after apply)%0A      + region                                 = "us-east-1"%0A      + transition_default_minimum_object_size = "all_storage_classes_128K"%0A%0A      + rule {%0A          + id     = "log-retention"%0A          + status = "Enabled"%0A            # (1 unchanged attribute hidden)%0A%0A          + expiration {%0A              + days                         = 365%0A              + expired_object_delete_marker = false%0A            }%0A%0A          + filter {%0A                # (1 unchanged attribute hidden)%0A            }%0A%0A          + transition {%0A              + days          = 30%0A              + storage_class = "STANDARD_IA"%0A            }%0A          + transition {%0A              + days          = 90%0A              + storage_class = "GLACIER"%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0] will be created%0A  + resource "aws_s3_bucket_ownership_controls" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-1"%0A%0A      + rule {%0A          + object_ownership = "ObjectWriter"%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_policy.this[0] will be created%0A  + resource "aws_s3_bucket_policy" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A      + region = "us-east-1"%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0] will be created%0A  + resource "aws_s3_bucket_public_access_block" "this" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + region                  = "us-east-1"%0A      + restrict_public_buckets = true%0A      + skip_destroy            = true%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-1"%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm     = "AES256"%0A                # (1 unchanged attribute hidden)%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_versioning.this[0] will be created%0A  + resource "aws_s3_bucket_versioning" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-1"%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 11 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*